import string
import re

# Приклад текста
text = "це приклад тексту! скільки в ньому речень? в тексті є 2 цифри: 1 та 2."
#text = input('Введіть текст для обробки: \n') # це , якщо треба запросити текст для вводу користувачем

# Изменяем текст так, чтобы каждое предложение начиналось с большой буквы
sentences = re.split(r'[.!?] +', text) # раздеяем тест на отдельные предложения по признаку окончания предложения как .!?
capitalized_text = '.'.join(sentence.capitalize() for sentence in sentences) #преобразуэм в текст с предложенияими, которые начинаются с Большой буквы и конце предложения стоит точка 
corrected_text = capitalized_text.replace('.', '. ').replace('!', '! ').replace('?', '? ')# вставляем после .!? пробел чтобы разделить пробелом предложения.
print("Текст з кожним реченням, яке починається з великої літери:")
print(corrected_text)

# Подсчитываем количество цифр в тексте
count = 0
for ch in text:
    if ch.isdigit():
        count = count + 1
print("Кількість цифр у тексті:", count)

# Подсчитываем количество знаков препинания в тексте
count = 0
for ch in text:
    if ch in string.punctuation:
        count = count + 1
print("Кількість розділових знаків у тексті:", count)

# Подсчитываем количество восклицательных знаков в тексте
count = 0
count = text.count('!')
print("Кількість знаків оклику в тексті:", count)