print('Введіть 3 числа: ')
a=float(input('Введіть перше число: '))
b=float(input('Введіть друге число: '))
c=float(input('Введіть третє число: '))
import math
print('Оберіть операцію:')
print('1: обраховуємо максимум з трьох чисел')
print('2: обраховуємо мінімум з трьох чисел')
print('3: обраховуємо середнє арифметичне трьох чисел')
n=float(input())
if n-math.trunc(abs(n))==0.0:
    n=int(n)
    if n==1:
         print('Максимум трьох чисел дорівнює ',max(a,b,c))
    else:
        if n==2:
         print('Мінімум трьох чисел дорівнює ',min(a,b,c))
        else:
            if n==3:
                 print('Середнє арифметичне трьох чисел дорівнює ',round((a+b+c)/3,2)) 
            else:
                 print('Ви ввели неправильну операцію')      
else:
     print('Ви ввели неправильну операцію') 
