m=float(input('Введіть кількість метрів: '))
if m<0:
    print('Метри не можить бути відємними ')
else:
    print('Оберіть номер операції, що потрібно порахувати: ') 
    print('1: переводимо метри у милі: ')  
    print('2: переводимо метри у дюйми: ')
    print('3: переводимо метри у ярди: ')
    n=float(input())
    import math
    if n-math.trunc(abs(n))==0.0:
        n=int(n)
        if n==1:
             print(str(m)+' метрів  = '+str(round(m*0.000621371,3))+' милі')
        elif n==2:
             print(str(m)+' метрів  = '+str(round(m*39.3701,3))+' дюймів')
        elif n==3:
             print(str(m)+' метрів  = '+str(round(m*1.09361,3))+' ярдів')
        else: 
             print('Введено невірний номер операції')  
    else:
         print('Введено невірний номер операції')         

