_seconds=int(input('Введіть час у секундах, який пройшов з початку доби: '))
if _seconds>=0:
    if _seconds<=86400:
     print('Оберіть номер операції, що потрібно порахувати: ') 
     print('1: час, що залишився до кінця доби, у годинах: ')  
     print('2: час, що залишився до кінця доби, у хвилинах: ')
     print('3: час, що залишився до кінця доби, у секундах: ')
     n=float(input())
     import math
     if n<0:
         print('Введено невірний номер операції')  
     if n-math.trunc(abs(n))==0.0:
        n=int(n)
        if n==1:
             #підраховуємо скільки секунд, хвилин, годин пройшло с початку доби
             _hours=math.trunc(_seconds/3600) #скільки цілих годин пройшло
             _minutes=math.trunc(_seconds/60)-_hours*60 #скільки хвилин, які не увійшли у цілі години, що пройшли з початку доби
             _seconds=_seconds-math.trunc(_seconds/60)*60 #скільки секунд, які не увійшли у цілі години та цілі хвилини, що пройшли с початку доби
             print('Час, що пройшов з початку доби, дорівнює '+str(_hours)+' годин(a) '+str(_minutes)+' хвилин(а) '+str(_seconds)+' секунд(а)')
             
             #підраховуємо скільки секунд, хвилин, годин залишилося до кінця доби
             if _minutes==0 and _seconds==0:
                 print('Час, що залишився до кінця доби, дорівнює '+str(24-_hours)+' годин(a) '+str(_minutes)+' хвилин(а) '+str(_seconds)+' секунд(а)')  
             if _minutes!=0 and _seconds!=0:
                 print('Час, що залишився до кінця доби, дорівнює '+str(24-_hours-1)+' годин(a) '+str(60-_minutes-1)+' хвилин(а) '+str(60-_seconds)+' секунд(а)')
             if _minutes!=0 and _seconds==0:
                 print('Час, що залишився до кінця доби, дорівнює '+str(24-_hours-1)+' годин(a) '+str(60-_minutes)+' хвилин(а) '+str(_seconds)+' секунд(а)')
             if _minutes==0 and _seconds!=0:
                 print('Час, що залишився до кінця доби, дорівнює '+str(24-_hours)+' годин(a) '+str(_minutes)+' хвилин(а) '+str(60-_seconds)+' секунд(а)')
         
        elif n==2:
             #підраховуємо скільки секунд, хвилин пройшло с початку доби
             _minutes=math.trunc(_seconds/60) #скільки цілих хвилин, що пройшли з початку доби
             _seconds=_seconds-math.trunc(_seconds/60)*60 #скільки залишилося секунд, які не увійшли у цілі хвилини, що пройшли с початку доби
             print('Час, що пройшов з початку доби, дорівнює '+str(_minutes)+' хвилин(а) '+str(_seconds)+' секунд(а)')
             
             #підраховуємо скільки секунд, хвилин залишилося до кінця доби
             if _seconds==0:
                 print('Час, що залишився до кінця доби, дорівнює '+str(24*60-_minutes)+' хвилин(а) '+str(_seconds)+' секунд(а)')  
             if _seconds!=0:
                 print('Час, що залишився до кінця доби, дорівнює '+str(24*60-_minutes-1)+' хвилин(а) '+str(60-_seconds)+' секунд(а)')
             if _minutes==0 and  _seconds==0:
                 print('Час, що залишився до кінця доби, дорівнює 24 години 00 хвилин 00 секунд ')

        elif n==3:
             print('Час, що пройшов з початку доби, дорівнює '+str(_seconds)+ ' секунд(а)')  
             print('Час, що залишився до кінця доби, дорівнює '+str(24*60*60-_seconds)+ ' секунд(а)')                  
        
        else: 
             print('Введено невірний номер операції')  
    else:
         print('Ви ввели кількість секунд, що перевищує цілу добу.')           
else:
     print('Значення часу не може бути відємним')         


