print('Введіть вартіть 1 ігрової приставки: ')
v=float(input())
if v>=0:
    print('Введіть кількість ігрових приставок: ')
    k=float(input())
    import math
    if k-math.trunc(abs(k))==0.0:
        if k>=0:
            print('Введіть відсоток знижки ігрової приставки: ')
            z=float(input())
            if z<=100:
                if z>=0:
                    print('Оберіть номер операції, що потрібно порахувати. ') 
                    print('1: загальна сума замовлення; ')  
                    print('2: вартість 1 приставки з урахуванням знижки; ')
                    n=int(input())
                    if n==1:
                        Summa=v*k*(100-z)/100
                        print('Загальна сума замовлення дорівнює ', round(Summa,2))
                    elif n==2:
                        Summa=v*(100-z)/100
                        print('Вартість 1 приставки з урахуванням знижки дорівнює ', round(Summa,2))
                    else: 
                        print('Введено невірний номер операції')   
                else:
                    print('Знижка не може бути відємною. ') 
            else:
                print('Знижка не може бути більше, ніж 100% ')      
        else:
            print('Кількість не може бути відємною. ') 
    else:
       print('Введено невірне число для кількості. ')              
else:
    print('Вартість не може бути відємною. ')

    



