print('Введіть 3 цифри: ')
a=int(input('Введіть 1а цифра, відмінна від нуля: '))

if a==0:
    print('Перша цифра повинна бути відмінна від нуля. Програма закінчена.')
else:
     b=int(input('Введіть 2а цифра: '))
     c=int(input('Введіть 3я цифра: '))
     if a<0 or b<0 or c<0:
        print('Введені цифри не можуть бути відємними.')
     else:
         if a>0  and a<=9 and b>=0 and b<=9 and c>=0 and c<=9:           
              print('Створюване число: ',100*a+10*b+c)
         else:
             print('Цифри введено невірно. Цифри повинні бути від 1 до 9.')